nameofapp/app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "rating", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "test"], ["rating", 2], ["product_id", 1], ["user_id", 2], ["created_at", "2015-12-18 13:52:00.311651"], ["updated_at", "2015-12-18 13:52:00.311651"]]
---
	def create
		@product = Product.find(params[:product_id])
 		@comment = @product.comments.new(comment_params)
 		@comment.user = current_user
 		respond_to do |format|
 			if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
	def destroy
		@comment = Comment.find(params[:id])
		product = @comment.product
		@comment.destroy