nameofapp/app/controllers/products_controller.rb

  def index
   if Rails.env.development?
    if params[:q]
      search_term = params[:q]
      @products = Product.where("name LIKE ?", "%#{search_term}%")
      # return out filtered list here
    else
      @products = Product.all
---
SELECT "products".* FROM "products" WHERE (name ilike '%test%')
SELECT "products".* FROM "products"

  def show
    @comments = @product.comments.paginate(:page => params[:page], :per_page => 3)
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ?  ORDER BY created_at DESC  [["product_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["description", "Test"], ["image_url", ""], ["created_at", "2015-11-10 11:17:54.014052"], ["updated_at", "2015-11-10 11:17:54.014052"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "image_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_url", "/Users/timseithe/OneDrive/CareerFoundry/my_cf_project_final/img/portfolioheroimage-crop.jpg"], ["updated_at", "2015-11-21 17:12:30.998402"], ["id", 1]]