nameofapp/app/views/shared/_comments.html.erb

			<hr>
			<p><%= comment.user.first_name %>&nbsp<small><em><%= "#{time_ago_in_words(comment.created_at)}" %></em></small></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]